
tiime_options = {
    "RU": [
        "5 секунд",
        "15 секунд",
        "30 секунд",
        "1 минута",
        "5 минуты",
        "10 минуты",
        "15 минуты",
    ]
}

ftm = {
    "RU": "Знакомьтесь с нашим уникальным торговым ботом, который стал настоящим спасением для многих инвесторов! Этот инновационный инструмент работает на уровне высочайшей точности, предоставляя своим пользователям эксклюзивные сигналы по трейдингу бинарными опционами. Независимо от вашего уровня опыта - начинающий трейдер или профессионал, наш бот поможет вам достичь финансового успеха.\nС помощью передовых технологий и аналитических данных, наш бот позволяет делать высокодоходные сделки, а его интеллектуальная система анализа рынка предсказывает будущие тренды с невероятной точностью. Надежность, эффективность и оперативность - вот ключевые преимущества нашего бота.",
}

you_paid = {
    "RU": "Теперь вам активна функция трейдинга в ручном режиме что бы начать торговать нажмите кнопку опции",
}

indicator_form = {
    "RU": "💱Валютная пара:({trade_tools})\n⏳Время эксперации:({trade_time_str})\n\n\n✅ Бот рекомендует открывать торги на {trade_direction} \nВремя на использование сигнала 15 секунд",
}

lose_text = {
    "RU": """Бот рекомендует вам сделать паузу 5 минут, вы проигрывайте из за разницы в тайм фрейме вашего устройства и бота!\nЧерез 5 минут вам нужно выбрать новую трейдинговую пару обновить страницу и подтвердить обновление и выбор новой пары для трейдинга !""",
}

sub_to_channel = {
    "RU": "Подпишитесь на канал (напишите мне в личку: {user_id} , я выдам доступ)",
}

send_trader_id = {
    "RU": "Отправьте ваш ид пользователя в таком формате: 123456789",
}

trading_methods = {
    "RU": ["Ручной трейдинг", "Управляемый трейдинг"],
}

menu = {
    "RU": "Меню:",
}

default_seconds = {
    "RU": "15 секунд",
}

trade_direction = {
    "RU": ["Понижение📉", "Повышение📈"],
}

trade_result_question = {
    "RU": "Какой вы получили результат по последней  сделке ({trade_tool})?",
}

trade_result_types = {
    "RU": ["Выигрыш", "Проигрыш"]
}

choose_trade_pair = {
    "RU": "Выберите торговую пару : {random_trade_tool}\nВ опции: {random_trade_type}\nВремя эксперации: {random_trade_time_str}",
}

confirm_choice = {
    "RU": "Подтверждаю выбор нужных данных!",
}

bot_analizing_please_wait = {
    "RU": "Бот Анализирует рынок, Пожалуйста подождите",
}

win_wait = {
    "RU": "Ожидайте в течении 2-10 минут бот отправит вам новый подходящий сигнал"
}

lose_wait = {
    "RU": "Ожидайте бот сейчас анализирует в чем возникла проблема и рекомендует вам перезапустить страницу браузера для лучшей синхронизации"
}

i_have_updated_site = {
    "RU": "Я обновил страницу Браузера",
}

manual_trading = {
    "RU": "Ручной трейдинг",
}

auto_trading = {
    "RU": "Управляемый трейдинг"
}

auto_trading_signals_time = {
    "RU": ["10 минут (2 сигнала)", "20 минут (4 сигнала)", "30 минут Рекомендация! (5 сигналов)"],
}

auto_trading_question_count = {
    "RU": "Выберите сколько у вас есть времени для торговой сессии? (с суммой депозита до 50 бакс вы можете использовать бота 2 раз в сутки)",
}

options = {
    "RU": "Опции:"
}

analise_found_5 = {
    "RU": "Анализ рынка выявил 5 наилучших торговых пар:"
}

win = {
    "RU": "Выигрыш"
}

win_amount = {
    "RU": "Напишите сумму выигрыша"
}

lose = {
    "RU": "Проигрыш"
}

lose_confirm_refresh = {
    "RU": "Я подтверждаю обновление страницы и выбор новой пары для трейдинга !"
}

back = {
    "RU": "Назад в Меню"
}

wait_trading_done = {
    "RU": "Пока ваша торговля не окончена вы не можете использовать новые сигналы!",
}

click_win_or_lose = {
    "RU": "Нажмите на кнопку Выигрыш или Проигрыш",
}

for_pay = {
    "RU": "Что бы получить доступ к ручному трейдингу вам нужно внести депозит 50 долларов!\nПосле того как вы сделайте депозит отправьте ид пользователя и скриншот менеджеру тогда вам будет доступна функция ручного трейдинаг\n(Ссылка на чат с менеджером)",
}
TRADER_TOOLS = {
    "RU": {
        "Валюты": {
            "tools": [
                "AED/CNY OTC",
                "AUD/CAD OTC",
                "AUD/NZD OTC",
                "AUD/USD OTC",
                "CAD/CHF OTC",
                "CAD/JPY OTC",
                "EUR/CHF OTC",
                "EUR/GBP OTC",
                "EUR/TRY OTC",
                "GBP/AUD OTС",
                "GBP/JPY OTC",
                "JOD/CNY OTC",
                "LBP/USD OTC",
                "MAD/USD OTC",
                "SAR/CNY OTC",
                "USD/BRL OTC",
                "USD/CNH OTC",
                "USD/COP OTC",
                "USD/DZD OTC",
                "USD/INR OTC",
                "USD/JPY OTC",
                "USD/MXN OTC",
                "USD/MYR OTC",
                "USD/PKR OT",
                "USD/RUB OTC",
                "USD/SGD OTC",
                "USD/THB OTC",
                "CHF/NOK OTC",
                "EUR/HUF OTC",
                "EUR/JPY OTC",
                "TND/USD OTC",
                "YER/USD OTС",
                "USD/VND OTC",
                "GBP/USD OTC",
                "USD/CAD OTC",
                "QAR/CNY OTC",
                "EUR/NZD OTC",
                "USD/IDR OTC",
                "BHD/CNY OTC",
                "EUR/RUB OTC",
                "USD/BDT OTC",
                "USD/EGP OTC",
                "NZD/USD OTC",
                "EUR/USD OTC",
                "USD/CLP OTC",
                "AUD/JPY OTC",
                "USD/ARS OTC",
                "USD/PHP OTC",
                "OMR/CNY OTС",
                "CHF/JPY OTC",
                "NZD/JPY OTC",
                "AUD/CHF OTC",
                "USD/CHF OTC",
            ],
            "time": tiime_options["RU"],
        },
        "Криптовалюты": {
            "tools": [
                "Cardano OTС",
                "Avalanche OTC",
                "Bitcoin ETF OTC",
                "Chainlink OTC",
                "Polygon OTC",
                "Toncoin OTC",
                "TRON OTC",
                "Ethereum OTC",
                "Bitcoin OTC",
                "Ripple OTC",
                "Litecoin OTC",
                "BNB OTC",
                "Solana OTC",
                "Polkadot OTC",
                "Dogecoin OTC",
            ],
            "time": tiime_options["RU"],
            "image": "",
        },
        "Сырьевые товары": {
            "tools": [
                "Brent Oil OTC",
                "WTI Crude Oil OTC",
                "Silver OTC",
                "Gold OTC",
                "Natural Gas OTC",
                "Palladium spot OTC",
                "Platinum spot OTC",
            ],
            "time": tiime_options["RU"],
            "image": "",
        },
        "Акции": {
            "tools": [
                "Apple OTC",
                "American Express OTC",
                "Intel OTC",
                "Pfizer Inc OTC",
                "Citigroup Inc OTC",
                "TWITTER OTC",
                "McDonald's OTC",
                "VISA OTC",
                "Microsoft OTC",
                "Alibaba OTC",
                "Johnson & Johnson OTС",
                "Cisco OTC",
                "Boeing Company OTC",
                "Amazon OTC",
                "FedEx OTC",
                "Tesla OTC",
                "ExxonMobil OTC",
                "Netflix OTC",
                "FACEBOOK INC OTC",
            ],
            "time": tiime_options["RU"],
        },
        "Индексы": {
            "tools": [
                "AUS 200 OTC",
                "100GBP OTC",
                "D30EUR OTC",
                "DJI30 OTC",
                "E35EUR OTC",
                "E50EUR OTC",
                "F40EUR OTC",
                "JPN225 OTC",
                "US100 OTC",
                "SP500 OTC",
            ],
            "time": tiime_options["RU"],
        },
    }
}

